export let questionsList = [
    {
        "id": 1,
        "name": "В каком году началась первая мировая война ?",
        "rightAnswer": "1914",
        "answerOptions": "1972, 1941, 1917, 1914",
        "enteringLargeResponce": "",
        "enteringSmallResponce": "",
        "test": 1
    },
    {
        "id": 2,
        "name": "28 июня 1914 года сербским националистом убит наследник Австрийской империи Франц Фердинанд. Кем он приходится царствовавшему императору Францу Иосифу, который правит уже больше 60 лет?",
        "rightAnswer": "Племянником",
        "answerOptions": "Сыном, Племянником, Внуком, Братом",
        "enteringLargeResponce": "",
        "enteringSmallResponce": "",
        "test": 1
    },
    {
        "id": 3,
        "name": "Август 1914 года. Война только началась, но уже четко обозначились два соперничающих блока: Антанта против Тройственного союза. В Антанту входят Англия, Франция и Россия, а в Тройственный союз — Германия, Австро-Венгрия и…",
        "rightAnswer": "Италия",
        "answerOptions": "Османская империя, Италия, Болгария, Сербия",
        "enteringLargeResponce": "",
        "enteringSmallResponce": "",
        "test": 1
    },
    {
        "id": 4,
        "name": "С коалициями разобрались. Но война началась не только из-за убийства австрийского наследника. Поводы к масштабному столкновению начали копиться гораздо раньше. Какое из этих событий в наибольшей степени повлияло на расстановку сил в Европе к началу войны?",
        "rightAnswer": "Франко-прусская война 1870–1871 годов",
        "answerOptions": "Балканские войны 1912–1913 годов, Русско-турецкая война 1877–1878 годов, Русско-японская война 1904–1905 годов, Франко-прусская война 1870–1871 годов",
        "enteringLargeResponce": "",
        "enteringSmallResponce": "",
        "test": 1
    },
    {
        "id": 5,
        "name": "Германский император Вильгельм II настроен решительно и, говоря о военных планах немцев, заявляет, что завтракать он будет в Париже, а ужинать…",
        "rightAnswer": "в Петербурге: сначала одержит победу на Западном фронте, а потом на Восточном",
        "answerOptions": "в Петербурге: сначала одержит победу на Западном фронте, а потом на Восточном, в Мадриде: Испания придерживается нейтралитета, но это не повод не нападать на нее, в Белграде: нужно показать этим сербам, кто на Балканах хозяин, в Берлине: быстро разберутся с французами и вернутся домой",
        "enteringLargeResponce": "",
        "enteringSmallResponce": "",
        "test": 1
    },
    {
        "id": 6,
        "name": "Для России война началась довольно удачно: русские теснят австрийцев на Юго-Западном фронте, занимают Львов, Буковину, Галицию и подходят к Карпатам. Но из-за нехватки боеприпасов начинается «Великое отступление». Когда оно происходило?",
        "rightAnswer": "В 1915 году",
        "answerOptions": "В 1917 году, В 1915 году, В 1914 году, В 1916 году",
        "enteringLargeResponce": "",
        "enteringSmallResponce": "",
        "test": 1
    },
    {
        "id": 7,
        "name": "Итак, 1915 год стал трагическим для российской армии: в результате тактического отступления она не только упустила завоеванные земли, но также потеряла ряд собственных территорий. Какую область Российской империи удалось сохранить?",
        "rightAnswer": "Финляндию",
        "answerOptions": "Курляндию (Литву), Царство Польское, Галицию, Финляндию",
        "enteringLargeResponce": "",
        "enteringSmallResponce": "",
        "test": 1
    },
    {
        "id": 8,
        "name": "Какое из сражений Первой мировой войны оказалось самым долгим и тяжелым?",
        "rightAnswer": "Битва при Вердене",
        "answerOptions": "Брусиловский прорыв, Битва при Вердене, Галицийская битва, Марнское сражение",
        "enteringLargeResponce": "",
        "enteringSmallResponce": "",
        "test": 1
    },
    {
        "id": 9,
        "name": "Конец 1915 года. Сербия захвачена участниками Четверного союза, сербские войска ушли в Албанию. Что послужило главной причиной этого?",
        "rightAnswer": "Вступление в войну Болгарии",
        "answerOptions": "Вступление в войну Болгарии, Убийство Григория Распутина, Присоединение Италии к Антанте, Занятие немецкими войсками Варшавы",
        "enteringLargeResponce": "",
        "enteringSmallResponce": "",
        "test": 1
    },
    {
        "id": 10,
        "name": "Война оказывает значительное влияние на развитие военной инженерии. Все время используются новые типы оружия, создаются новые проекты вооружения. Что из перечисленного так и не было использовано во время Первой мировой войны?",
        "rightAnswer": "Планерные бомбы",
        "answerOptions": "Подводные лодки, Боевые отравляющие газы, Танки, Планерные бомбы",
        "enteringLargeResponce": "",
        "enteringSmallResponce": "",
        "test": 1
    },
    {
        "id": 11,
        "name": "По ходу войны империи рушатся одна за другой. Но одной все же удалось выстоять, несмотря на все потрясения. Какой?",
        "rightAnswer": "Британской империи",
        "answerOptions": "Российской империи, Османской империи, Германской империи, Австрийской империи, Британской империи",
        "enteringLargeResponce": "",
        "enteringSmallResponce": "",
        "test": 1
    }
]

export let testsList = [
    {
        "id": 1,
        "name": "Начало первой мировой войны",
        "complexity" : "легкий",
        "class" : 10,
        "partition" : "XX век",
        "theme": 1,
    }
]

export let themesList = [
    {
        "id": 1,
        "name": "Первая мировая война",
        "subject": 8
    }
]

export let subjectList = [
    {
        "id": 1,
        "name": "Русский язы"
    },
    {
        "id": 2,
        "name": "Литература"
    },
    {
        "id": 3,
        "name": "Информатика"
    },
    {
        "id": 4,
        "name": "Математика"
    },
    {
        "id": 5,
        "name": "Физика"
    },
    {
        "id": 6,
        "name": "Химия"
    },
    {
        "id": 7,
        "name": "Биология"
    },
    {
        "id": 8,
        "name": "История"
    }
]